Ran Plan for dir: `env/stg/devops/ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/bin/terraform plan -input=false -refresh -out "/root/.atlantis/repos/DevOpsTechGroup/search-recommand-terraform/29/default/env/stg/devops/ap-northeast-2/search-recommand-devops-apnortheast2-stg-default.tfplan" -lock=true' in '/root/.atlantis/repos/DevOpsTechGroup/search-recommand-terraform/29/default/env/stg/devops/ap-northeast-2': exit status 1
module.iam.aws_iam_role.custom_role["ecs-task-exec-role"]: Refreshing state... [id=ecs-task-exec-role]
module.network.aws_vpc.main: Refreshing state... [id=vpc-0f61fb747b68b8f91]
module.iam.aws_iam_role.custom_role["ecs-task-role"]: Refreshing state... [id=ecs-task-role]
module.iam.aws_iam_policy.custom_policy["ecs-task-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/ecs-task-role-policy]
module.iam.data.aws_iam_policy.managed_policy["ecs-auto-scaling-role-policy"]: Reading...
module.iam.aws_iam_role.custom_role["atlantis-terraform-role"]: Refreshing state... [id=atlantis-terraform-role]
module.iam.aws_iam_role.custom_role["ecs-auto-scaling-role"]: Refreshing state... [id=ecs-auto-scaling-role]
module.iam.aws_iam_policy.custom_policy["ecs-task-exec-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/ecs-task-exec-role-policy]
module.iam.aws_iam_policy.custom_policy["atlantis-terraform-role-policy"]: Refreshing state... [id=arn:aws:iam::842675972665:policy/atlantis-terraform-role-policy]
module.network.aws_subnet.private_subnet[2]: Refreshing state... [id=subnet-045bb7283c30f5797]
module.network.aws_subnet.public_subnet[2]: Refreshing state... [id=subnet-07b528026644bcb89]
module.network.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0407000179e878a57]
module.network.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-00d840bb0c6cafc9d]
module.network.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0181d979eb8c447d8]
module.network.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-04eeffa9848ca7ead]
module.network.aws_route_table.private_route_table: Refreshing state... [id=rtb-030fa6812947c07b4]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-03dda805abd5199e4]
module.network.aws_route_table.public_route_table: Refreshing state... [id=rtb-0c573088cdbe95f63]
module.network.aws_route_table_association.private_route_table_association[1]: Refreshing state... [id=rtbassoc-06802b65c4cec8e9c]
module.network.aws_route_table_association.private_route_table_association[2]: Refreshing state... [id=rtbassoc-0131ea150b1ca6a06]
module.network.aws_route_table_association.private_route_table_association[0]: Refreshing state... [id=rtbassoc-0c86193303f0585d3]
module.network.aws_route_table_association.public_route_table_association[1]: Refreshing state... [id=rtbassoc-0c74263a61d62f054]
module.network.aws_route_table_association.public_route_table_association[2]: Refreshing state... [id=rtbassoc-0d8615ab35e950f66]
module.network.aws_route_table_association.public_route_table_association[0]: Refreshing state... [id=rtbassoc-01b69210f9d48ff0d]
module.security.aws_security_group.ecs_security_group["elasticsearch-api-sg"]: Refreshing state... [id=sg-08c02a9d108a73faa]
module.security.aws_security_group.ecs_security_group["opensearch-api-sg"]: Refreshing state... [id=sg-0732c95bc86c4b84a]
module.security.aws_security_group.ec2_security_group["opensearch-sg"]: Refreshing state... [id=sg-0f3e5a0efcdf6d955]
module.security.aws_security_group.ec2_security_group["atlantis-sg"]: Refreshing state... [id=sg-025c1df6fce302fc0]
module.security.aws_security_group.ec2_security_group["elasticsearch-sg"]: Refreshing state... [id=sg-0ea36658394f65021]
module.security.aws_security_group.alb_security_group["search-recommand-alb-sg"]: Refreshing state... [id=sg-029aa161b859482d2]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-185.199.108.0_22-e9fc9971"]: Refreshing state... [id=sgrule-1049262625]
module.security.aws_security_group_rule.ecs_egress_security_group["opensearch-api-sg-stg-egress-0-0-0.0.0.0_0-60a4dce1"]: Refreshing state... [id=sgrule-3079265306]
module.security.aws_security_group_rule.ecs_egress_security_group["elasticsearch-api-sg-stg-egress-0-0-0.0.0.0_0-f9f4bad0"]: Refreshing state... [id=sgrule-4126786437]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-172.21.0.0_16-ea346bed"]: Refreshing state... [id=sgrule-1665742516]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-220.75.180.0_24-91eb1021"]: Refreshing state... [id=sgrule-2726639255]
module.security.aws_security_group_rule.ec2_egress_security_group["elasticsearch-sg-stg-egress-0-0-0.0.0.0_0-6a567ae2"]: Refreshing state... [id=sgrule-2979335450]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-39.118.148.0_24-ea346bed"]: Refreshing state... [id=sgrule-1287085654]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-39.118.148.0_24-1df03ba0"]: Refreshing state... [id=sgrule-616658585]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-192.30.252.0_22-ea346bed"]: Refreshing state... [id=sgrule-1171398354]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-140.82.112.0_20-e9fc9971"]: Refreshing state... [id=sgrule-482879056]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-185.199.108.0_22-ea346bed"]: Refreshing state... [id=sgrule-570715776]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-220.75.180.0_24-1df03ba0"]: Refreshing state... [id=sgrule-720037946]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-143.55.64.0_20-e9fc9971"]: Refreshing state... [id=sgrule-2166541542]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-192.30.252.0_22-e9fc9971"]: Refreshing state... [id=sgrule-2812796291]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-220.75.180.0_24-1df03ba0"]: Refreshing state... [id=sgrule-2637403559]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-172.21.0.0_16-4e245c91"]: Refreshing state... [id=sgrule-1054809100]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-172.21.0.0_16-e9fc9971"]: Refreshing state... [id=sgrule-218786881]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-39.118.148.0_24-91eb1021"]: Refreshing state... [id=sgrule-2897127476]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-172.21.0.0_16-bafbf0d7"]: Refreshing state... [id=sgrule-854165380]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-39.118.148.0_24-bafbf0d7"]: Refreshing state... [id=sgrule-798472735]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-22-22-220.75.180.0_24-bafbf0d7"]: Refreshing state... [id=sgrule-565978300]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-220.75.180.0_24-4e245c91"]: Refreshing state... [id=sgrule-3040571397]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-9200-9200-172.21.0.0_16-91eb1021"]: Refreshing state... [id=sgrule-1883416832]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-39.118.148.0_24-e9fc9971"]: Refreshing state... [id=sgrule-2931989767]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-9200-9200-172.21.0.0_16-1df03ba0"]: Refreshing state... [id=sgrule-692305307]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-4141-4141-220.75.180.0_24-e9fc9971"]: Refreshing state... [id=sgrule-2699625380]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-172.21.0.0_16-1df03ba0"]: Refreshing state... [id=sgrule-1665991554]
module.security.aws_security_group_rule.ec2_ingress_security_group["elasticsearch-sg-stg-ingress-22-22-39.118.148.0_24-4e245c91"]: Refreshing state... [id=sgrule-3138449062]
module.security.aws_security_group_rule.ec2_ingress_security_group["atlantis-sg-stg-ingress-22-22-220.75.180.0_24-ea346bed"]: Refreshing state... [id=sgrule-1117569269]
module.security.aws_security_group_rule.ec2_ingress_security_group["opensearch-sg-stg-ingress-5601-5601-39.118.148.0_24-1df03ba0"]: Refreshing state... [id=sgrule-2467826436]
module.security.aws_security_group_rule.ec2_egress_security_group["opensearch-sg-stg-egress-0-0-0.0.0.0_0-aba5a023"]: Refreshing state... [id=sgrule-496860603]
module.security.aws_security_group_rule.ec2_egress_security_group["atlantis-sg-stg-egress-0-0-0.0.0.0_0-07b503bf"]: Refreshing state... [id=sgrule-3063956457]
module.security.aws_security_group_rule.alb_security_group_ingress_rule["search-recommand-alb-sg-stg-ingress-443-443-220.75.180.0_24-a52d3dda"]: Refreshing state... [id=sgrule-793350763]
module.security.aws_security_group_rule.alb_security_group_ingress_rule["search-recommand-alb-sg-stg-ingress-80-80-220.75.180.0_24-0c12137f"]: Refreshing state... [id=sgrule-4185966312]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.ecr.aws_ecr_repository.ecr_repository["elasticsearch-api"] will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "elasticsearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "elasticsearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "elasticsearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr.aws_ecr_repository.ecr_repository["opensearch-api"] will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "opensearch-api-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "opensearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "opensearch-api-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.storage.aws_dynamodb_table.terraform_state_lock["search-recommand-tfstate-lock"] will be created
  + resource "aws_dynamodb_table" "terraform_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "search-recommand-tfstate-lock-stg"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"      = "search-recommand-tfstate-lock-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all         = {
          + "Name"      = "search-recommand-tfstate-lock-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.storage.aws_s3_bucket.s3["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket" "s3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "search-recommand-tfstate-stg"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "search-recommand-tfstate-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                    = {
          + "Name"      = "search-recommand-tfstate-stg"
          + "createdBy" = "ymkim1085@funin.camp"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_public_access_block.public_access_block["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.storage.aws_s3_bucket_server_side_encryption_configuration.server_side_encrypt["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "server_side_encrypt" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_versioning.versioning["search-recommand-tfstate"] will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Error: reading IAM Policy (arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole): operation error IAM: GetPolicy, https response error StatusCode: 403, RequestID: 12ce6372-57ea-4b2d-9203-34da71bdee43, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:GetPolicy on resource: policy arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole because no identity-based policy allows the iam:GetPolicy action
│ 
│   with module.iam.data.aws_iam_policy.managed_policy["ecs-auto-scaling-role-policy"],
│   on ../../../../modules/aws/iam/main.tf line 4, in data "aws_iam_policy" "managed_policy":
│    4: data "aws_iam_policy" "managed_policy" {
│ 
╵
╷
│ Error: reading inline policies for IAM role atlantis-terraform-role, error: operation error IAM: ListRolePolicies, https response error StatusCode: 403, RequestID: 42a051bf-e132-45f8-9725-fa9cf314d02e, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:ListRolePolicies on resource: role atlantis-terraform-role because no identity-based policy allows the iam:ListRolePolicies action
│ 
│   with module.iam.aws_iam_role.custom_role["atlantis-terraform-role"],
│   on ../../../../modules/aws/iam/main.tf line 10, in resource "aws_iam_role" "custom_role":
│   10: resource "aws_iam_role" "custom_role" {
│ 
╵
╷
│ Error: reading inline policies for IAM role ecs-task-role, error: operation error IAM: ListRolePolicies, https response error StatusCode: 403, RequestID: 8f809763-a4cc-4402-a7c4-af3f553d9ae4, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:ListRolePolicies on resource: role ecs-task-role because no identity-based policy allows the iam:ListRolePolicies action
│ 
│   with module.iam.aws_iam_role.custom_role["ecs-task-role"],
│   on ../../../../modules/aws/iam/main.tf line 10, in resource "aws_iam_role" "custom_role":
│   10: resource "aws_iam_role" "custom_role" {
│ 
╵
╷
│ Error: reading inline policies for IAM role ecs-auto-scaling-role, error: operation error IAM: ListRolePolicies, https response error StatusCode: 403, RequestID: 7ef9c5bb-3feb-44b1-a3af-b1dcec5d8f48, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:ListRolePolicies on resource: role ecs-auto-scaling-role because no identity-based policy allows the iam:ListRolePolicies action
│ 
│   with module.iam.aws_iam_role.custom_role["ecs-auto-scaling-role"],
│   on ../../../../modules/aws/iam/main.tf line 10, in resource "aws_iam_role" "custom_role":
│   10: resource "aws_iam_role" "custom_role" {
│ 
╵
╷
│ Error: reading inline policies for IAM role ecs-task-exec-role, error: operation error IAM: ListRolePolicies, https response error StatusCode: 403, RequestID: 8ce4fdf0-61bf-4b96-9974-826e428db637, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:ListRolePolicies on resource: role ecs-task-exec-role because no identity-based policy allows the iam:ListRolePolicies action
│ 
│   with module.iam.aws_iam_role.custom_role["ecs-task-exec-role"],
│   on ../../../../modules/aws/iam/main.tf line 10, in resource "aws_iam_role" "custom_role":
│   10: resource "aws_iam_role" "custom_role" {
│ 
╵
╷
│ Error: reading IAM Policy (arn:aws:iam::842675972665:policy/atlantis-terraform-role-policy): operation error IAM: GetPolicy, https response error StatusCode: 403, RequestID: 41e09a10-fb95-4692-8940-31988dd45b1c, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:GetPolicy on resource: policy arn:aws:iam::842675972665:policy/atlantis-terraform-role-policy because no identity-based policy allows the iam:GetPolicy action
│ 
│   with module.iam.aws_iam_policy.custom_policy["atlantis-terraform-role-policy"],
│   on ../../../../modules/aws/iam/main.tf line 25, in resource "aws_iam_policy" "custom_policy":
│   25: resource "aws_iam_policy" "custom_policy" {
│ 
╵
╷
│ Error: reading IAM Policy (arn:aws:iam::842675972665:policy/ecs-task-role-policy): operation error IAM: GetPolicy, https response error StatusCode: 403, RequestID: bbf0cf72-512a-4589-8c86-095261dea689, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:GetPolicy on resource: policy arn:aws:iam::842675972665:policy/ecs-task-role-policy because no identity-based policy allows the iam:GetPolicy action
│ 
│   with module.iam.aws_iam_policy.custom_policy["ecs-task-role-policy"],
│   on ../../../../modules/aws/iam/main.tf line 25, in resource "aws_iam_policy" "custom_policy":
│   25: resource "aws_iam_policy" "custom_policy" {
│ 
╵
╷
│ Error: reading IAM Policy (arn:aws:iam::842675972665:policy/ecs-task-exec-role-policy): operation error IAM: GetPolicy, https response error StatusCode: 403, RequestID: 7a5aef14-63ab-472c-8889-6f19ff9bf21f, api error AccessDenied: User: arn:aws:sts::842675972665:assumed-role/atlantis-terraform-role/i-0b7e6e771efe3542f is not authorized to perform: iam:GetPolicy on resource: policy arn:aws:iam::842675972665:policy/ecs-task-exec-role-policy because no identity-based policy allows the iam:GetPolicy action
│ 
│   with module.iam.aws_iam_policy.custom_policy["ecs-task-exec-role-policy"],
│   on ../../../../modules/aws/iam/main.tf line 25, in resource "aws_iam_policy" "custom_policy":
│   25: resource "aws_iam_policy" "custom_policy" {
│ 
╵


```
</details>